app/controllers/api/songs_controller.rb

  def index
    if params[:artist_id]
      @songs = Song.where(artist_id: params[:artist_id])
    else
      @songs = Song.all
---
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = $1  [["artist_id", 3]]
SELECT "songs".* FROM "songs"

  def search
    @songs = Song.where("title LIKE ?", "#{params[:search_term]}%")
---
SELECT "songs".* FROM "songs" WHERE (title LIKE '%')

  def create
    @song = Song.new(song_params)
    @song.artist_id = current_user.id

    if @song.save
---
INSERT INTO "songs" ("title", "genre", "song_file_name", "song_content_type", "song_file_size", "song_updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"