app/views/api/songs/_song.json.jbuilder

SELECT "songs".* FROM "songs" WHERE (title LIKE '%')
---
if current_user
  json.liked current_user.get_liked_song_ids.include?(song.id)

INSERT INTO "songs" ("title", "genre", "song_file_name", "song_content_type", "song_file_size", "song_updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
json.genre song.genre
json.created_at song.created_at